oneyearXF/STM32F1-RTOS-Store/HardWare/Serial/bsp_Serial.h
#ifndef __BSP_SERIAL_H
#define __BSP_SERIAL_H
/* -------------------------------------------------------------------------- */
/* include*/
#include "stm32f10x.h"
#include "stdio.h"
#include "string.h"
#include "ring_buffer.h"

#define USART_RECV_BUF_SIZE 500
#define USART_SEND_BUF_SIZE 500

// UART Enable
#define USART1_ENABLE 0
#define USART2_ENABLE 0
#define USART3_ENABLE 1


// UART1 related parameters
#if USART1_ENABLE
    // Baud rate
    #define USART1_BAUDRATE 115200
    // Clock definition
    #define USART1_CLK RCC_APB2Periph_USART1
    #define USART1_APBxClkCmd RCC_APB2PeriphClockCmd
    #define USART1_GPIO_CLK RCC_APB2Periph_GPIOA
    #define USART1_GPIO_APBxClkCmd RCC_APB2PeriphClockCmd
    // GPIO pin definition
    #define USART1_TX_GPIO_PORT GPIOA
    #define USART1_TX_GPIO_PIN GPIO_Pin_9
    #define USART1_RX_GPIO_PORT GPIOA
    #define USART1_RX_GPIO_PIN  GPIO_Pin_10
#endif

// UART2 related parameters
#if USART2_ENABLE
    #define USART2_BAUDRATE 115200
    // Clock definition
    #define USART2_CLK RCC_APB1Periph_USART2
    #define USART2_APBxClkCmd RCC_APB1PeriphClockCmd
    #define USART2_GPIO_CLK RCC_APB2Periph_GPIOA
    #define USART2_GPIO_APBxClkCmd RCC_APB2PeriphClockCmd
    // GPIO pin definition
    #define USART2_TX_GPIO_PORT GPIOA
    #define USART2_TX_GPIO_PIN GPIO_Pin_2
    #define USART2_RX_GPIO_PORT GPIOA
    #define USART2_RX_GPIO_PIN  GPIO_Pin_3
#endif

// UART3 related parameters
#if USART3_ENABLE
    #define USART3_BAUDRATE 115200
    // Clock definition
    #define USART3_CLK RCC_APB1Periph_USART3
    #define USART3_APBxClkCmd RCC_APB1PeriphClockCmd
    #define USART3_GPIO_CLK RCC_APB2Periph_GPIOB
    #define USART3_GPIO_APBxClkCmd RCC_APB2PeriphClockCmd
    // GPIO pin definition
    #define USART3_TX_GPIO_PORT GPIOB
    #define USART3_TX_GPIO_PIN GPIO_Pin_10
    #define USART3_RX_GPIO_PORT GPIOB
    #define USART3_RX_GPIO_PIN  GPIO_Pin_11
#endif

typedef struct
{  
    USART_TypeDef *pUSARTx;
    // Transmit buffer
    RingBufferTypeDef *sendBuf;
	// Receive buffer
    RingBufferTypeDef *recvBuf;
} Usart_DataTypeDef;

// Set all members of gc_block to 0, size is sizeof(parser_block_t)
#if USART1_ENABLE
    extern Usart_DataTypeDef usart1;
    extern uint8_t usart1SendBuf[USART_SEND_BUF_SIZE+1];
	extern uint8_t usart1RecvBuf[USART_RECV_BUF_SIZE+1];
	extern RingBufferTypeDef usart1SendRingBuf;
	extern RingBufferTypeDef usart1RecvRingBuf;
#endif

#if USART2_ENABLE
	extern uint8_t usart2SendBuf[USART_SEND_BUF_SIZE+1];
	extern uint8_t usart2RecvBuf[USART_RECV_BUF_SIZE+1];
	extern RingBufferTypeDef usart2SendRingBuf;
	extern RingBufferTypeDef usart2RecvRingBuf;
	extern Usart_DataTypeDef usart2;

#endif

#if USART3_ENABLE
    extern uint8_t usart3SendBuf[USART_SEND_BUF_SIZE+1];
	extern uint8_t usart3RecvBuf[USART_RECV_BUF_SIZE+1];
	extern RingBufferTypeDef usart3SendRingBuf;
	extern RingBufferTypeDef usart3RecvRingBuf;
	extern Usart_DataTypeDef usart3;
#endif

// Initialize UART
void Usart_Init(void);
// Send a byte
void Usart_SendByte(USART_TypeDef *pUSARTx, uint8_t ch);
// Send an array of bytes
void Usart_SendByteArr(USART_TypeDef *pUSARTx, uint8_t *byteArr, uint16_t size);
// Send a string
void Usart_SendString(USART_TypeDef *pUSARTx, char *str);
// Send all content in the UART transmit buffer
void Usart_SendAll(Usart_DataTypeDef *usart);
/* -------------------------------------------------------------------------- */
/* define */
#define USART1_FLAG			1
#define USART2_FLAG			2
#define USART3_FLAG			3
/* -------------------------------------------------------------------------- */
/* 函数声明 */
void MyUSART_Config(USART_TypeDef* USARTx, uint16_t GPIO_TX, uint16_t GPIO_RX, GPIO_TypeDef* GPIOx);
void Serial_SentData(uint8_t Data, int16_t flag);
void Serial_SentMath(uint8_t math[], uint8_t length, int16_t flag);
uint32_t Serial_Pow(uint8_t x, uint8_t y);
void Serial_SentNum(uint8_t Number, uint8_t length, int16_t flag);
void Serial_SentString(char *string, int16_t flag);
uint8_t Serial_GetRxData_X(void);
uint8_t Serial_GetRxData_Y(void);
uint8_t Serial_GetRxData_ColorPicture(void);
int fputc(int ch, FILE *f);
//接收中断
void USART1_IRQHandler(void);
void USART2_IRQHandler(void);
void USART3_IRQHandler(void);
/* -------------------------------------------------------------------------- */

#endif
